-- Dev seed part 1

INSERT INTO "adm_healthcare_service" ("id", "tenant_id", "created_at", "updated_at", "created_by", "updated_by", "is_deleted", "deleted_at", "deleted_by", "version", "name", "type_code", "category_code", "offered_org_id", "specialty_code", "location_id", "status_enum", "active_flag", "appointment_required_flag", "yb_no", "bus_no", "comment", "extra_details", "contact")
VALUES
('322957224354254848', '1', '2026-06-10 04:36:42.541+00', '2026-06-10 06:57:21.250+00', '1', '1', false, NULL, NULL, 0, '便民号', '1', NULL, NULL, NULL, NULL, 'ACTIVE', true, NULL, '001', 'HS0001', NULL, NULL, NULL),
('322957264586018816', '1', '2026-06-10 04:36:52.133+00', '2026-06-10 06:57:31.630+00', '1', '1', false, NULL, NULL, 0, '普通号', '1', NULL, NULL, NULL, NULL, 'ACTIVE', true, NULL, '002', 'HS0002', NULL, NULL, NULL),
('322957296852799488', '1', '2026-06-10 04:36:59.826+00', '2026-06-10 06:57:36.527+00', '1', '1', false, NULL, NULL, 0, '专家号', '1', NULL, NULL, NULL, NULL, 'ACTIVE', true, NULL, '003', 'HS0003', NULL, NULL, NULL),
('322957328119180160', '1', '2026-06-10 04:37:06.000+00', '2026-06-10 04:37:06.000+00', '1', '1', false, NULL, NULL, 0, '历史号复诊', '4', NULL, NULL, NULL, NULL, 'ACTIVE', true, false, '004', 'HS_HIST_FOLLOW_UP', NULL, NULL, NULL)
ON CONFLICT ("id") DO NOTHING;

INSERT INTO "adm_patient" ("id", "tenant_id", "created_at", "updated_at", "created_by", "updated_by", "is_deleted", "deleted_at", "deleted_by", "version", "bus_no", "name", "name_json", "gender_enum", "birth_date", "status_enum", "active_flag", "temp_flag", "id_card", "marital_status_enum", "prfs_enum", "phone", "address", "address_province", "address_city", "address_district", "address_street", "address_extend_json", "nationality_code", "py_str", "wb_str", "blood_type_abo", "blood_type_rh", "work_company", "native_place", "country_code", "link_name", "link_relation_code", "link_telcom", "link_jsons", "deceased_date", "deceased_reason", "organization_id", "merged_target_patient_id", "merged_at") VALUES ('325580322788872192', '1', '2026-06-17 10:19:57.942+00', '2026-06-17 10:19:57.942+00', '1', '1', false, NULL, NULL, 0, 'PA0001', '李先生', NULL, 'MALE', '2000-12-31 16:00:00.000+00', 'ACTIVE', true, false, '220322200101012356', NULL, NULL, '', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'LXS', 'STT', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '322663218269917184', NULL, NULL) ON CONFLICT ("id") DO NOTHING;

INSERT INTO "adm_pr_assign" ("id", "tenant_id", "created_at", "updated_at", "created_by", "updated_by", "is_deleted", "deleted_at", "deleted_by", "version", "name", "active_flag", "practitioner_id", "org_id", "location_id", "specialty_code", "type_code", "role_id")
VALUES
('322965878747435008', '1', '2026-06-10 05:11:05.909+00', '2026-06-10 05:11:05.909+00', '1', '1', false, NULL, NULL, 0, 'admin', true, '308791351298756608', '322663218269917184', NULL, NULL, NULL, '14'),
('322965878747435009', '1', '2026-06-10 05:11:05.909+00', '2026-06-10 05:11:05.909+00', '1', '1', false, NULL, NULL, 0, 'admin', true, '308791351298756608', '322663308812357632', NULL, NULL, NULL, '14'),
('322965878827126784', '1', '2026-06-10 05:11:05.928+00', '2026-06-10 05:11:05.928+00', '1', '1', false, NULL, NULL, 0, 'admin', true, '308791351298756608', '322663218269917184', NULL, NULL, NULL, '10'),
('322965878831321088', '1', '2026-06-10 05:11:05.929+00', '2026-06-10 05:11:05.929+00', '1', '1', false, NULL, NULL, 0, 'admin', true, '308791351298756608', '322663308812357632', NULL, NULL, NULL, '10'),
('322965878902624256', '1', '2026-06-10 05:11:05.946+00', '2026-06-10 05:11:05.946+00', '1', '1', false, NULL, NULL, 0, 'admin', true, '308791351298756608', NULL, '322954857622802432', NULL, NULL, '13'),
('322965878902624257', '1', '2026-06-10 05:11:05.946+00', '2026-06-10 05:11:05.946+00', '1', '1', false, NULL, NULL, 0, 'admin', true, '308791351298756608', NULL, '322954885380706304', NULL, NULL, '13'),
('322965878902624258', '1', '2026-06-10 05:11:05.946+00', '2026-06-10 05:11:05.946+00', '1', '1', false, NULL, NULL, 0, 'admin', true, '308791351298756608', NULL, '322954919841107968', NULL, NULL, '13'),
('322965878961344512', '1', '2026-06-10 05:11:05.960+00', '2026-06-10 05:11:05.960+00', '1', '1', false, NULL, NULL, 0, 'admin', true, '308791351298756608', NULL, '322954949549363200', NULL, NULL, '12'),
('322965878961344513', '1', '2026-06-10 05:11:05.960+00', '2026-06-10 05:11:05.960+00', '1', '1', false, NULL, NULL, 0, 'admin', true, '308791351298756608', NULL, '322954984441778176', NULL, NULL, '12'),
('322965878961344514', '1', '2026-06-10 05:11:05.960+00', '2026-06-10 05:11:05.960+00', '1', '1', false, NULL, NULL, 0, 'admin', true, '308791351298756608', NULL, '322955039064199168', NULL, NULL, '12'),
('322965878961344515', '1', '2026-06-10 05:11:05.960+00', '2026-06-10 05:11:05.960+00', '1', '1', false, NULL, NULL, 0, 'admin', true, '308791351298756608', NULL, '322955009603407872', NULL, NULL, '12'),
('322965878965538816', '1', '2026-06-10 05:11:05.961+00', '2026-06-10 05:11:05.961+00', '1', '1', false, NULL, NULL, 0, 'admin', true, '308791351298756608', NULL, '322955075642724352', NULL, NULL, '12'),
('322965878965538817', '1', '2026-06-10 05:11:05.961+00', '2026-06-10 05:11:05.961+00', '1', '1', false, NULL, NULL, 0, 'admin', true, '308791351298756608', NULL, '322955098803671040', NULL, NULL, '12'),
('322965879007481856', '1', '2026-06-10 05:11:05.971+00', '2026-06-10 05:11:05.971+00', '1', '1', false, NULL, NULL, 0, 'admin', true, '308791351298756608', NULL, '322955305339588608', NULL, NULL, '11'),
('322972360645808128', '1', '2026-06-10 05:36:51.314+00', '2026-06-10 05:36:51.314+00', '1', '1', false, NULL, NULL, 0, '门诊医生', true, '322963602326687744', '322663218269917184', NULL, NULL, NULL, '14'),
('322972360708722688', '1', '2026-06-10 05:36:51.329+00', '2026-06-10 05:36:51.329+00', '1', '1', false, NULL, NULL, 0, '门诊医生', true, '322963602326687744', '322663218269917184', NULL, NULL, NULL, '10'),
('322972376974233600', '1', '2026-06-10 05:36:55.207+00', '2026-06-10 05:36:55.207+00', '1', '1', false, NULL, NULL, 0, '住院医生', true, '322935698173202432', '322663308812357632', NULL, NULL, NULL, '14'),
('322972377024565248', '1', '2026-06-10 05:36:55.219+00', '2026-06-10 05:36:55.219+00', '1', '1', false, NULL, NULL, 0, '住院医生', true, '322935698173202432', '322663308812357632', NULL, NULL, NULL, '10'),
('322977240106668032', '1', '2026-06-10 05:56:14.668+00', '2026-06-10 05:56:14.668+00', '1', '1', false, NULL, NULL, 0, '药房', true, '322932010683207680', NULL, '322954949549363200', NULL, NULL, '12'),
('322977240106668033', '1', '2026-06-10 05:56:14.668+00', '2026-06-10 05:56:14.668+00', '1', '1', false, NULL, NULL, 0, '药房', true, '322932010683207680', NULL, '322955009603407872', NULL, NULL, '12'),
('323016460792238080', '1', '2026-06-10 08:32:05.608+00', '2026-06-10 08:32:05.608+00', '1', '1', false, NULL, NULL, 0, '库管', true, '322932096108597248', NULL, '322954885380706304', NULL, NULL, '13'),
('323016460863541248', '1', '2026-06-10 08:32:05.625+00', '2026-06-10 08:32:05.625+00', '1', '1', false, NULL, NULL, 0, '库管', true, '322932096108597248', NULL, '322954949549363200', NULL, NULL, '12'),
('323016460863541249', '1', '2026-06-10 08:32:05.625+00', '2026-06-10 08:32:05.625+00', '1', '1', false, NULL, NULL, 0, '库管', true, '322932096108597248', NULL, '322955009603407872', NULL, NULL, '12'),
('323016460863541250', '1', '2026-06-10 08:32:05.625+00', '2026-06-10 08:32:05.625+00', '1', '1', false, NULL, NULL, 0, '库管', true, '322932096108597248', NULL, '322955075642724352', NULL, NULL, '12'),
('323021900276043776', '1', '2026-06-10 08:53:42.482+00', '2026-06-10 08:53:42.482+00', '1', '1', false, NULL, NULL, 0, '护士', true, '322965022887120896', NULL, '322954857622802432', NULL, NULL, '13'),
('323021900347346944', '1', '2026-06-10 08:53:42.499+00', '2026-06-10 08:53:42.499+00', '1', '1', false, NULL, NULL, 0, '护士', true, '322965022887120896', NULL, '322955098803671040', NULL, NULL, '12'),
('323021900347346945', '1', '2026-06-10 08:53:42.499+00', '2026-06-10 08:53:42.499+00', '1', '1', false, NULL, NULL, 0, '护士', true, '322965022887120896', NULL, '322955075642724352', NULL, NULL, '12'),
('323021900393484288', '1', '2026-06-10 08:53:42.510+00', '2026-06-10 08:53:42.510+00', '1', '1', false, NULL, NULL, 0, '护士', true, '322965022887120896', NULL, '322955305339588608', NULL, NULL, '11')
ON CONFLICT ("id") DO NOTHING;
